import React from 'react';
import { Card } from 'react-bootstrap';

const Yinsi = ({  }) => {
  return (
    <Card>
      <Card.Body>
        <Card.Header>隐私政策</Card.Header>
        <Card.Text>
        隐私政策<br/>
        <br/>
更新时间：2024年01月29日<br/>
生效时间：2024年01月29日<br/>
<br/>
尊敬的用户，欢迎您使用我们的产品。我们非常重视您的个人信息和隐私保护。在您使用我们的服务之前，请您仔细阅读并充分了解本隐私政策。如您有任何疑问，可通过本政策末尾提供的联系方式与我们联系。<br/>
<br/>
本服务的名称：速推AI<br/>
<br/>
一、我们收集的信息<br/>
<br/>
为了向您提供更好的服务，我们可能会收集以下信息：<br/>
1. 为保障您的账号、网络、运营及系统安全，预防钓鱼网站欺诈及木马病毒，在您使用本产品的过程中，我们会收集您的设备相关信息，包括 设备型号、操作系统版本、软件版本号、设备配置、设备网络信息、网络状态、应用程序列表、设备环境，其中包括不可变更的设备唯一标识（ICCID、IMEI号、IDFA、OAID、GUID、OPENUDID、SIM卡IMSI信息、IP、Android ID、运行中的进程等）、硬件序列号、OAID、MAC地址，网络ip，软件安装列表 等用于了解产品适配性、识别账号异常状态。<br/>
2. 用户操作日志：包括您在使用我们的服务过程中产生的操作记录。<br/>
<br/>
二、我们如何使用收集的信息<br/>
<br/>
我们收集的信息将用于以下目的：<br/>
1. 为您提供文字转视频的功能和服务。<br/>
2. 优化我们的产品，提升您的使用体验。<br/>
3. 分析使用情况，以便我们更好地了解用户需求，改进我们的服务。<br/>
4. 保障您的账号安全，防止未经授权的访问和使用。<br/>
5. 通过收集设备信息来识别设备的兼容性问题，解决问题，确保服务正常运行。<br/>
<br/>
三、我们如何保护您的信息<br/>
<br/>
1. 我们会采取合理的技术措施，如加密技术、匿名化处理等，保护您的个人信息，防止未经授权的访问、使用或泄露。<br/>
2. 我们会对员工进行严格的培训，以确保他们了解并遵守本隐私政策。<br/>
<br/>
四、信息披露<br/>
<br/>
我们非常尊重您的个人信息，除法律法规要求或本政策另有规定外，未经您的明确同意，我们不会将您的个人信息向任何第三方披露。<br/>
<br/>
五、使用第三方SDK<br/>
<br/>
SDK名称：友盟SDK<br/>
使用目的：用户统计分析<br/>
收集个人信息类型： 设备型号、操作系统版本、软件版本号、设备配置、设备网络信息、网络状态、应用程序列表、设备环境，其中包括不可变更的设备唯一标识（ICCID、IMEI号、IDFA、OAID、GUID、OPENUDID、SIM卡IMSI信息、IP、Android ID、运行中的进程等）、硬件序列号、OAID、MAC地址，网络ip，软件安装列表 等<br/>
隐私权政策链接：https://www.umeng.com/page/policy<br/>
<br/>
SDK名称：友盟推送SDK<br/>
使用目的：为在不同机型上实现消息推送，我们为您提供手机厂商SDK（包含小米、oppo、vivo、魅族、华为、荣耀等厂商）的便捷配置渠道，您可在通过该手机厂商通道下发消息时接入相应SDK，在隐私政策中披露所选合作方SDK的采集情况。
友盟推送SDK包含的厂商SDK信息详见：https://www.umeng.com/tube/eK4wByxpmy54a23YiX64<br/>
<br/>
六：应用自启动能力<br/>
<br/>
1、为确保本应用处于关闭或后台运行状态下可正常接收到客户端推送的广播信息如视频制作完成后的通知提醒，本应用须使用(自启动)能力，将存在一定频率通过系统发送广播唤醒本应用自启动或关联启动行为，是因实现功能及服务所必要的。<br/>
2、本应用使用的自启动能力通过集成umeng的sdk来实现，具体进程为com.taobao.accs。<br/>
<br/>
七、未成年人隐私权保护<br/>
<br/>
我们非常重视未成年人的信息保护。如您是18周岁以下的未成年人，请在法定监护人的陪同下阅读本政策，并在征得您的监护人同意的情况下使用我们的服务。<br/>
<br/>
八、账号注销<br/>
<br/>
在注销账户之后，我们将停止为您提供产品或服务并依据您的要求，删除或匿名化您的信息，法律法规另有规定的除外。这也将可能导致您失去对您账户中数据的访问权，请您谨慎操作。<br/>
<br/>
注销您账号说明：<br/>
您需要注销您在App上上注册的账号，您可以采取以下途径：<br/>
（1）您可以通过【登入app】-【点击我的】-【点击设置】-【注销账号】-申请注销；<br/>
即可自助完成注销。<br/>
在注销账号后，我们将停止为您提供产品或服务，永久删除您的账号、您的注册资料、您账号内的所有数据、以及您的使用痕迹，但根据相关法律法规规定必须留存一定期限的内容除外。<br/>
<br/>
九、隐私政策的更新<br/>
<br/>
我们可能会不时更新本隐私政策。如本政策有任何修改，我们将在我们的App上发布修改后的版本。如您继续使用我们的服务，即表示您接受并同意修改后的隐私政策。<br/>
<br/>
十、联系我们<br/>
<br/>
如您对本隐私政策有任何疑问或建议，请通过以下方式与我们联系：<br/>
电子邮件：xuliang2022@gmail.com<br/>
最后，我们希望您能够在使用我们的服务时放心，并祝您使用愉快！<br/>
应用运营方：杭州风与鲨数字科技有限公司 应用名称：速推AI<br/>
        </Card.Text>
      </Card.Body>
    </Card>
  );
};

export default Yinsi;
